from settings import task_9_table as table
from utils import dataframe_to_latex_table

import numpy as np

print(
    r"""\section{Завдання 9}
\begin{itemize}
    \item На основі початкової вибірки сформувати таблицю спряженості. Інтервали зміни кількісної ознаки задати самостійно.
    \item Розрахувати бісеріальний коефіцієнт кореляції. У яких випадках його використовують?
\end{itemize}
\\
Досліджується залежність сереньорічного прибутку 5190 респондентів від статі. Для варіанту $i$ взяти 100 спостережень з номерами від $100(i-1) + 1$ до $100i.$
\\
Для мого варіанту $i=7,$ тому беремо номери спостережень від 601 до 700.
\subsection{Таблиця спряженості}
Таблиця спряженості має вигляд:"""
)

print(dataframe_to_latex_table(table))

print(
    r"""\subsection{Бісеріальний коефіцієнт кореляції}
\\
\includegraphics[width = 15cm, height = 4cm]{bis.PNG} \\
Зробимо необхiднi розрахунки:"""
)

n1 = sum(table.loc["Чоловіки", :])
n2 = sum(table.loc["Жінки", :])
n = n1 + n2

Y1 = (
    sum([a * b for a, b in zip(table.loc["Чоловіки", :], table.loc["Медіана", :])]) / n1
)
Y2 = sum([a * b for a, b in zip(table.loc["Жінки", :], table.loc["Медіана", :])]) / n2
Y = sum([a * b for a, b in zip(table.loc["Всього", :], table.loc["Медіана", :])]) / n
mse = np.sqrt(
    sum(
        [
            a * (b - Y) ** 2
            for a, b in zip(table.loc["Всього", :], table.loc["Медіана", :])
        ]
    )
    / (n - 1)
)

print(f"$$\\overline{{Y_1}} = {round(Y1, 3)}$$")
print(f"$$\\overline{{Y_2}} = {round(Y2, 3)}$$")
print(f"$$\\overline{{Y}} = {round(Y, 3)}$$")
print(f"$$\\sigma_Y = {round(mse, 3)}$$")

print(f"$$n_1 = {n1}, \\; \\; n_2 = {n2}, \\; \\; n = {n}$$")

r_bis = abs(Y2 - Y1) / mse * np.sqrt(n1 * n2 / (n * (n - 1)))

print(
    r"Тодi отримаємо: $$\displaystyle r_{bis} = \displaystyle \frac{|\overline{Y_2} - \overline{Y_1|}}{\sigma_y}\cdot \displaystyle \frac{n_1 \cdot n_2}{n(n-1)}="
    + f"{round(r_bis, 3)}$$"
)

print(
    r"""Коефіцієнт кореляції бісеріальний — коефіцієнт кореляції між двома змінними, із яких одна виміряна в дихотомічній шкалі, друга в інтервальній.\\
Бісеріальний коефіцієнти кореляції запропоновано К.Пірсоном. Його призначено для дослідження кореляції в таблицях розміром $2 \times n$, які є дихотоміями за певною номінальною ознакою і класифікаціями за номінальною або порядковою ознакою, що класифікується за q класами.(За допомогою нього оцінюють залежність між двома ознаками, один з яких виміряно в шкалі найменувань з двома градаціями ознаки (дихотомічної шкалою)). \\
Бісеріальний коефіцієнти кореляції змінюються в діапазоні від -1 до +1, однак слід пам'ятати, що в даному випадку знак для інтерпретації не має значення (це виняток із загального правила).\\"""
)
