from data.table_a10 import table
import pandas as pd
import numpy as np
import settings
from statistics import median_grouped as median

X = settings.task_7_X
Y = settings.task_7_Y
df = table
med1 = median(df[X])
med2 = median(df[Y])

print(med1, med2)

a = len(df[(df[X] >= med1) & (df[Y] >= med2)])
b = len(df[(df[X] < med1) & (df[Y] >= med2)])
c = len(df[(df[X] >= med1) & (df[Y] < med2)])
d = len(df[(df[X] < med1) & (df[Y] < med2)])

print(a, b, c, d)

Ka = (a * d - b * c) / (a * d + b * c)

Kk = (a * d - b * c) / np.sqrt((a + b) * (b + d) * (d + c) * (a + c))

print(Ka, Kk)

print(
    r"""\newpage
\section{Завдання 7}
1. На основі початкових даних сформувати таблицю спряженості розміром 2х2 (для кількісної ознаки зробити градацію «вище або дорівнює медіані», «нижче медіани»).\\
2. Розрахувати коефіцієнти асоціації та контингенції, сформулювати висновки.
\subsection{Кореляцiйний аналiз категоризованих змiнних}
Ознака називається категоризованою, якщо її можливi «значення» описуються скiнченним числом станiв або градацiй. Слово «значення» взято в лапки, так як мова йде, як правило, не про числовi значення, а лише про певнi умовнi мiтки можливих станiв.\\
При статистичному аналізі двох категоризованих змінних початкові дані перетворюють до виду таблиці перехресних частот, яка називається двовхідною таблицею спряженості ознак $x_1$ і $x_2$ або просто таблицею спряженості. \\
Зробивши градацію отримали таблицю спряженності вигляду: \\"""
)

print(
    r"""\begin{tabular}{ |c|c|c| } 
\hline
\bigcell{l}{}
& 
\bigcell{l}{"""
    + (f"\\geq {round(med1, 3)}" if settings.task_7_X != "С" else "Чоловіки")
    + r"""} 
& 
\bigcell{l}{"""
    + (f"> {round(med1, 3)}" if settings.task_7_X != "С" else "Жінки")
    + r"""} \\ 
\hline
\bigcell{l}{$"""
    + f"{round(med2, 3)}"
    + r"""$}
& 
\bigcell{l}{"""
    + f"{a}"
    + r"""} 
& 
\bigcell{l}{"""
    + f"{b}"
    + r"""}\\
\hline
\bigcell{l}{$< """
    + f"{round(med2, 3)}"
    + r"""$}
& 
\bigcell{l}{"""
    + f"{c}"
    + r"""}
& 
\bigcell{l}{"""
    + f"{d}"
    + r"""}\\
\hline
\end{tabular}"""
)

print(
    r"""\subsection{Коефіцієнти асоціації Юла і контингенції Пірсона}
Для визначення тісноти зв’язку двох якісних ознак, кожна з яких складається тільки з двох груп, що є альтернативними, застосовуються коефіцієнти асоціації і контингенції.
\\
Коефіцієнт асоціації розраховується за формулою
$$K_{a} = \displaystyle\frac{ad-bc}{ad+bc}.$$
У тих випадках, коли один із показників у чотирьохклітинній таблиці відсутній, величина коефіцієнта асоціації буде дорівнювати $\pm 1,$ що дає дещо
перебільшену оцінку ступеня тісноти зв’язку між ознаками. Тоді необхідно використовувати коефіцієнт контингенції:
$$K_{k} = \displaystyle\frac{ad-bc}{\sqrt{(a+b)(b+d)(d+c)(a+c)}}$$
Розглянуті коефіцієнти змінюються від $-1$ до $+1.$ Коефіцієнт контингенції
завжди менший за коефіцієнт асоціації. Зв’язок між ознаками підтверджується,
якщо $K_{a} \geq  0.5$ або $K_{k} \geq  0.3$
\\"""
)

print(r"Розрахуємо коефіцієнт асоціації:")
print(f"$$K_{{a}} = {round(Ka, 3)}$$")
print(r"Розрахуємо коефіцієнт контингенції:")
print(f"$$K_{{k}} = {round(Kk, 3)}$$")

print(
    r"""Ми отримали, що коефіцієнт контингенції менший за коефіцієнт асоціації, що підтверджує правильність отриманих результатів. Обидва коефіцієнти менші за $0.5$ та $0.3$ відповідно, що говорить про відсутність зв'язку між ознаками. \\
Значення коефіцієнтів вказують на те, що зв’язок між статтю та екзальтованiстю(схильнiсть легко пiддаватися впливу оточуючих, постiйний пошук нових вражень, компанiй, вмiння легко встановлювати контакти, якi носять, щоправда, поверхневий характер) не підтверджується. """
)
