
print(r"""\section{Завдання 13}
Провести класифiкацiю ознак (див. додаток Б) методом дендритiв та методом кореляцiйних плеяд. При потребi нормалiзувати початковi данi. Сформулювати висновки.
\subsection{Розв'язання}
\subsubsection{Метод дендритів}
Дендрит—це ламана, що може розгалужуватись i з’єднує двi довiльнi точки, але
не може мати замкнених ламаних. У оптимальному дендритi—з найменшою сумою
довжин зв’язкiв—сумiжнi об’єкти мало вiдрiзняються один вiд одного. Отже, при побудовi дендриту виходять з мiнiмальної довжини зв’язкiв мiж об’єктами (заданi у матрицi вiдстаней або зв’язкiв). Для цього у матрицi вiдстаней вибираються найбiльш близькi елементи, тобто у кожному стовпчику (рядку) $j$ знаходимо найменше число $c_{ij}.$ Це означає, що об’єкти $j$ i $i$ найближчi. Складаємо попарнi сполучення близьких об’єктiв. Деякi сполучення можуть зустрiчатися двiчi, i тодi одне сполучення виключаємо. Може статися, що два сполучення мають однаковий об’єкт, i тому
їх об’єднуємо в одне сполучення (скупчення).
Цi сполучення називають сполученнями першого порядку. А так як вони можуть
бути не зв’язанi мiж собою, то побудова дендриту не закiнчена.
Далi обирається найменша вiдстань мiж сполученнями першого порядку (найменша вiдстань мiж об’єктами сполучень). Вiдповiдний зв’язок є зв’язком мiж двома
сполученнями, отримаємо сполучення другого порядку. Якщо i вони iзольованi, то процес побудови дендриту продовжуємо до тих пiр, поки не отримаємо одне сполучення. Пiсля отримання дендриту його необхiдно розбити на класи однорiдних об’єктiв. Якщо кiлькiсть класiв $k$ вiдома, то з дендриту видаляємо $k - 1$ найдовших зв’язкiв.
Якщо ж кiлькiсть класiв невiдома, то користуємося таким алгоритмом.
Зв’язки дендриту впорядковуємо за спаданням їх довжини i розраховуємо вiдно-
шення довжин сусiднiх зв’язкiв
$$i_2 = \frac{d_1}{d_2}, i_3 = \frac{d_2}{d_3}, ..., i_{n-1} = \frac{d_{n-2}}{d_{n-1}}$$
де $d_1, d_2, . . . , d_{n-1} -$ упорядкованi довжини зв’язкiв дендриту.
\\
Далi знаходимо значення, для якого виконується спiввiдношення, на якому грунтується розбиття множини об’єктiв на класи. Це спiввiдношення має вигляд $i_k < i_{k+1}$ (для $k = 2, 3, . . . , n - 1$). Може статися так, що в рядi отриманих спiввiдношень розглянута нерiвнiсть буде виконуватись декiлька разiв. Тому розглядається ще одне спiввiдношення, що дозволить обрати краще розбиття iз двох $i_k$ i $i_l.$ Якщо $i_k < i_l,$ то об’єкти розбиваємо на $k$ класiв.  \\ \\
\subsection{Метод кореляційних плеяд}
Метод кореляцiйних плеяд призначений для знаходження таких груп ознак— «плеяд», коли кореляцiйний зв’язок, тобто сума модулiв коефiцiєнтiв кореляцiї мiж праметрами однiєї групи, достатньо великий, а зв’язок мiж параметрами рiзних груп - малий. Використовуючи кореляцiйну матрицю ознак, утворюють граф, який за допомогою певних правил розбивають на пiдграфи. Елементи кожного iз пiдграфiв i утворюють плеяду. \\
Розглянемо перший алгоритм утворення плеяд. \\
Накреслимо $p$ кружкiв. Усерединi кожного кружка напишемо номер однiєї з
ознак. Кожен кружок з’єднуємо лiнiями зi всiма кружками. Над лiнiєю, що з’єднує
$i-$й i $j-$й елементи, пишемо значення модуля коефiцiєнта кореляцiї $|r_{ij}|.$ Отриманий
таким чином малюнок розглядаємо як початковий граф. \\
Задаємо деяке порогове значення коефiцiєнта кореляцiї $r_0$ (довiльним чином або
на основi попереднього вивчення кореляцiйної матрицi) i виключаємо з графа всi
ребра, якi вiдповiдають коефiцiєнтам кореляцiї, що за модулем меншi за $r_0.$ Потiм
задаємо деяке $r_1 > r_0$ i вiдносно нього повторюємо описану процедуру. При деякому
достатньо великому $r$ граф розпадається на декiлька пiдграфiв, тобто таких груп
кружкiв, що зв’язки мiж кружками рiзних груп вiдсутнi. Зрозумiло, що для отриманих таким чином плеяд внутрiшньоплеяднi коефiцiєнти кореляцiї будуть бiльшi за $r,$ а мiжплеяднi - меншi за $r.$\\
\textbf{Розглянемо ще один алгоритм кореляцiйних плеяд.} \\
У кореляцiйнiй матрицi знаходимо найбiльший за модулем коефiцiєнт кореляцiї,
наприклад, $|r_{l,m}| = r_1$ (дiагональнi елементи матрицi не розглядаються). \\
Креслимо кружки, що вiдповiдають параметрам $x_l$ i $x_m,$ з’єднуємо їх i над з’єдна-
нням пишемо значення $r_1.$ Потiм виключаємо $r_1$ i знаходимо найбiльший коефiцiєнт
у $m-$му стовпчику матрицi (це вiдповiдає знаходженню ознаки, яка найбiльш сильно
пiсля $x_l$ «пов’язана» з $x_m$) i найбiльший коефiцiєнт в $l-$му рядку матрицi (це вiдповiдає знаходженню ознаки, найбiльш сильно пiсля $x_m$ «пов’язаної» з $x_l$). Iз знайдених таким чином двох коефiцiєнтiв кореляцiї обирається найбiльший  - нехай це буде $|r_{l,j}|= r2.$ Креслимо кружок $x_j,$ з’єднуємо його з кружком $x_l$ i проставляємо значення $r_2.$ Потiм знаходимо ознаки, що найбiльш тiсно пов’язанi з $x_l,$ $x_m$ i $x_j,$ i обираємо найбiльший коефiцiєнт кореляцiї. Нехай це буде $|r_{j,q}| = r3.$ Нагадаємо, що на кожному кроцi повинна з’являтися нова ознака, тому ознаки, що зображенi на малюнку, виключаються. Отже, $q \neq  l, q \neq  m, q \neq  j.$ \\
Далi креслимо кружок, що вiдповiдає $x_q,$ з’єднуємо його з $x_j$ i т. д. На кожному кроцi знаходимо параметри (ознаки), що найбiльш сильно пов’язанi з двома останнiми параметрами, а потiм обирається один з них, який вiдповiдає бiльшому коефiцiєнтовi кореляцiї. Процедура закiнчується пiсля $p - 1$ кроку. Граф буде складатися з $p$ кружкiв, з’єднаних $p - 1$ ребром. Потiм задається порогове значення $r,$ i всi ребра, що вiдповiдають меншим за $r$ значенням, виключаються з графа.\\
\textbf{Означення.} Незамкнений граф - це граф, у якого для довiльних двох кружкiв
iснує один шлях з’єднання, а якщо бiльше одного, то це замкнений граф. \\
Другий варiант методу кореляцiйних плеяд дозволяє отримувати тiльки незамкненi графи, а у першому варiантi таке обмеження вiдсутнє. \\
Розглянемо переваги i недолiки методiв плеяд i дендритiв. Перевагою методiв є
їх простота i iнварiантнiсть їх алгоритму вiдносно характеру початкових даних.
Недолiком методiв є їх неформалiзованiсть, що утруднює застосування обчислю-
вальної технiки.\\\\
Розглянемо сім об’єктів (ознак) і матрицю відстаней між ними.\\
\begin{table}[H]
\centering
\begin{tabular}{l l l l l l l }
 0.  &  8.97& 11.15 & 10.47 & 11.64&  10.99 & 10.16\\
  8.97 &  0. &   13.29 & 10.86&  13.44&  13.99&   6.26\\
 11.15&  13.29 &  0. &    9.33  & 6.14 &  6.89 & 12.68\\
 10.47 & 10.86 &  9.33&   0.&     8.7 &  10.41&  11.03\\
 11.64&  13.44&   6.14  & 8.7  &  0. &    6.08&  12.21\\
 10.99&  13.99 &  6.89&  10.41 &  6.08  & 0.  &  13.16\\
 10.16 &  6.26&  12.68&  11.03&  12.21&  13.16&   0.  \\
\end{tabular}%
\end{table}
У кожному стовпчику знаходимо найменше число – найменшу відстань між об’єктами. Ці сполучення близьких об’єктів мають вигляд: 
\includepdf[pages=-]{zavdannya13.pdf}""")